## 04 - Harry Potter

A `data/hpattributes.txt` a Harry Potter könyvek különböző szereplőinek adatait (id, schoolyear, gender, house) tartalmazzák a szereplők nevei nélkül. A nevek a `data/hpnames.txt` fájlban találhatók a megfelelő id-kkal ellátva. 

(nemek: 1 - férfi, 2 - nő; házak: 1 - Griffendél, 2 - Hugrabug, 3 - Hollóhát, 4 - Mardekár)

- Fésüljük össze a két adattáblát az "id" oszlop segítségével és írjuk ki a Hollóhátba járó diákokat a koruk szerint növekvő sorrendben, vagyis a legfiatalabbtól indulva.

- Mennyi a Griffendélbe járó diákok átlagos életkora (2017-ben)? (A diákok 11 évesen kezdik a tanulmányaikat.)

- Írjuk ki a táblázatban szereplő 5 leggyakoribb évet gyakoriság szerint csökkenő sorrenben.

In [1]:
%pylab inline
import pandas as pd # szokásos plotok

Populating the interactive namespace from numpy and matplotlib

In [10]:
hpatt=pd.read_csv("../data/hpattributes.txt",header=0, sep='\t') # File beolvasás
hpnames=pd.read_csv("../data/hpnames.txt",header=0, sep='\t')
df=hpatt.merge(hpnames,how='inner',
             left_on='id',
             right_on='id') # Mergelés
df.head()

   id  schoolyear  gender  house               name
0   1        1989       1      4       Adrian Pucey
1   2        1989       2      1     Alicia Spinnet
2   3        1989       2      1   Angelina Johnson
3   4        1991       1      3  Anthony Goldstein
4   5        1991       1      4      Blaise Zabini

In [13]:
os=mdf[df["house"]==3].sort_values(by="schoolyear",ascending=True)
os

    id  schoolyear  gender  house                 name
50  51        1987       2      3  Penelope Clearwater
53  54        1989       1      3         Roger Davies
7    8        1990       2      3            Cho Chang
14  15        1990       1      3     Eddie Carmichael
37  38        1990       1      3         Marcus Belby
3    4        1991       1      3    Anthony Goldstein
36  37        1991       2      3   Mandy Brocklehurst
39  40        1991       1      3       Michael Corner
47  48        1991       2      3          Padma Patil
60  61        1991       1      3           Terry Boot
34  35        1992       2      3        Luna Lovegood
45  46        1994       2      3          Orla Quirke
58  59        1994       1      3     Stewart Ackerley

In [15]:
oss=mdf[(df["house"]==1)]['schoolyear']
meanoss=2017-(oss.mean()-11) # Soronkénti átlagot számolok
meanoss

37.039999999999964

In [18]:
y=df.groupby('schoolyear')[["schoolyear"]].count().sort_values(by="schoolyear",ascending=False).head()
y # a leggyakoribb évek

            schoolyear
schoolyear
1991                26
1994                10
1989                 9
1990                 5
1987                 3